wildlife_tracker/app/controllers/animals_controller.rb

    def index
        animals = Animal.all
---
SELECT "animals".* FROM "animals"

    def show
        animal = Animal.find(params[:id])
        sighting = Sighting.where(:animal_id => animal.id)
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "sightings".* FROM "sightings" WHERE "sightings"."animal_id" = $1  [["animal_id", nil]]

    def create
        animal = Animal.create(animal_params)
---
INSERT INTO "animals" ("common_name", "latin_name", "taxonomy_class", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["common_name", "Brown bear"], ["latin_name", "Ursus arctos"], ["taxonomy_class", "Mammal"], ["created_at", "2020-08-06 16:26:25.054518"], ["updated_at", "2020-08-06 16:26:25.054518"]]

    def destroy
        animal = Animal.find(params[:id])
        animal.destroy
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 5]]

    def update
        animal = Animal.find(params[:id])
        animal.update(animal_params)
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "animals" SET "common_name" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["common_name", "Puma"], ["updated_at", "2020-08-06 18:02:02.195999"], ["id", 2]]