wildlife_tracker/app/controllers/sightings_controller.rb

SELECT "sightings".* FROM "sightings" WHERE "sightings"."date" BETWEEN $1 AND $2  [["date", "2018-10-05 00:00:00"], ["date", "2020-07-05 00:00:00"]]
---
    def index
        @sightings = Sighting.where(date: params[:start_date]..params[:end_date])

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @sighting = Sighting.find(params[:id])

INSERT INTO "sightings" ("animal_id", "date", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @sighting = Sighting.create(sighting_params)

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 3]]
---
    def destroy
        @sighting = Sighting.find(params[:id])
        @sighting.destroy

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "sightings" SET "date" = $1, "updated_at" = $2 WHERE "sightings"."id" = $3  [["date", "2018-10-05 04:43:00"], ["updated_at", "2020-08-06 17:22:43.832785"], ["id", 2]]
---
    def update
        @sighting = Sighting.find(params[:id])
        @sighting.update(sighting_params)